const year = 2023;
const newYearText = 'В этом году новогодние каникулы продлятся 9 дней.';

let holiday = [
  {
    year,
    month: 0,
    day: 1,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 2,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 3,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 4,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 5,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 6,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 0,
    day: 7,
    class: '',
    hint: [
      {
        title: 'Рождество Христово',
        desc: 'Один из главных христианских праздников, отмечается всеми христианскими деноминациями.'
      }
    ]
  }, {
    year,
    month: 0,
    day: 8,
    class: '',
    hint: [
      {
        title: 'Новогодние каникулы',
        desc: newYearText
      }
    ]
  }, {
    year,
    month: 1,
    day: 23,
    class: '',
    hint: [
      {
        title: 'День защитника отечества',
        desc: 'Тут особо и не попишешь, вобщем женщинам нужно успеть закупиться носками и пеной для бритья.'
      }
    ]
  }, {
    year,
    month: 1,
    day: 24,
    class: '',
    hint: [
      {
        title: 'День защитника отечества',
        desc: 'Этот выходной переносится с 1 января.'
      }
    ]
  }, {
    year,
    month: 2,
    day: 8,
    class: '',
    hint: [
      {
        title: '8 марта',
        desc: 'Международный женский день. Появился как день солидарности женщин в борьбе за равные права и эмансипацию. С марта 1975 года Международный женский день отмечается в ООН. А если по честному, то кроме СНГ нигде он не отмечается.'
      }
    ]
  }, {
    year,
    month: 4,
    day: 1,
    class: '',
    hint: [
      {
        title: '1 мая',
        desc: 'В современной России 1 мая отмечается как Праздник Весны и Труда. Первомай в современном виде возник в середине XIX века в рабочем движении, выдвинувшем в качестве одного из основных требований введение восьмичасового рабочего дня. Первыми с требованием восьмичасового рабочего дня выступили рабочие Австралии 21 апреля 1856 года. С тех пор этот праздник в Австралии стал ежегодным. По образцу рабочих Австралии 1 мая 1886 года анархические организации США и Канады устроили ряд митингов и демонстраций. При разгоне такой демонстрации в Чикаго 4 мая 1886 года погибли шесть демонстрантов. '
      }
    ]
  }, {
    year,
    month: 4,
    day: 8,
    class: '',
    hint: [
      {
        title: 'Выходной день',
        desc: 'Выходной день.'
      }
    ]
  }, {
    year,
    month: 4,
    day: 9,
    class: '',
    hint: [
      {
        title: '9 мая',
        desc: 'Праздник победы Красной Армии и советского народа над нацистской Германией в Великой Отечественной войне 1941—1945 годов. Установлен Указом Президиума Верховного Совета СССР от 8 мая 1945 года и отмечается 9 мая каждого года. В 1945—1947 и с 1965 года День Победы — нерабочий праздничный день.'
      }
    ]
  }, {
    year,
    month: 5,
    day: 12,
    class: '',
    hint: [
      {
        title: 'День России',
        desc: 'День принятия Декларации о государственном суверенитете РСФСР, в просторечии - День независимости. Наверное, это самый противоречивый праздник в современной Российской действительности.)))'
      }
    ]
  }, {
    year,
    month: 10,
    day: 4,
    class: '',
    hint: [
      {
        title: 'День народного единства',
        desc: '22 октября (1 ноября) 1612 года народное ополчение под предводительством Кузьмы Минина и Дмитрия Пожарского штурмом взяло Китай-город, гарнизон Речи Посполитой отступил в Кремль. Князь Пожарский вступил в Китай-город с Казанской иконой Божией Матери. 23 октября (2 ноября) командование гарнизона подписало капитуляцию, выпустив тогда же из Кремля московских бояр и других знатных лиц. На следующий день 24 октября (3 ноября) гарнизон сдался. '
      }
    ]
  },
];

export default holiday;