const year = 2023;
let birthdaysArr = [
  {
    "year": year,
    "month": 0,
    "day": 13,
    "class": "",
    "hint": [
      {
        "title": "День рождения Ермолова Константина Петровича",
        "desc": "Костику 24 года, он любит панк-рок, ска. Костик работает в отделе веб-разработки, младшим веб-программистом. "
      }
    ]
  }, {
    "year": year,
    "month": 1,
    "day": 10,
    "class": "",
    "hint": [
      {
        "title": "День рождения Иванова Дмитрия Евгеньевича",
        "desc": "Дмитрию 32 года он любит пиво и хардкор. Дима работает в отделе веб-дизайна, старшим веб-дизайнером. "
      }
    ]
  },
  {
    "year": year,
    "month": 2,
    "day": 9,
    "class": "",
    "hint": [
      {
        "title": "День рождения Романова Павла Евгеньевича",
        "desc": "Павлу 30 лет, он любит читать, слушать музыку, рисовать. Паша работает в отделе веб-разработки, верстальщиком."
      }
    ]
  },
  {
    "year": year,
    "month": 3,
    "day": 8,
    "class": "",
    "hint": [
      {
        "title": "День рождения Сазонова Петра Алексеевича",
        "desc": "Петру 36 лет, он любит спорт. Петр работает в отделе веб-разработки, ведущим программистом"
      }
    ]
  },
  {
    "year": year,
    "month": 4,
    "day": 21,
    "class": "",
    "hint": [
      {
        "title": "День рождения Петренко Константина Михайловича",
        "desc": "Костику 26 лет он ходить в походы. Костик работает в отделе SEO-продвижения, младши копирайтером."
      }
    ]
  },
  {
    "year": year,
    "month": 5,
    "day": 18,
    "class": "",
    "hint": [
      {
        "title": "День рождения Колпакова Евгения Борисовича",
        "desc": "Жени 33 года он любит свою работу. Женя работает в отделе SEO-продвижения,  копирайтером."
      }
    ]
  },
  {
    "year": year,
    "month": 6,
    "day": 24,
    "class": "",
    "hint": [
      {
        "title": "День рождения Николаева Михаила Романовича",
        "desc": "Мише 20 лет, он любит учиться. Миша работает в отделе продаж, помощником менеджера продаж."
      }
    ]
  },
  {
    "year": year,
    "month": 7,
    "day": 13,
    "class": "",
    "hint": [
      {
        "title": "День рождения Насонова Максима Петровича",
        "desc": "Максу 25 лет он любит слушать музыку. Макс работает в отделе веб-разработки, младшим веб-программистом. "
      }
    ]
  },
  {
    "year": year,
    "month": 8,
    "day": 25,
    "class": "",
    "hint": [
      {
        "title": "День рождения Мирошниченко Алексея Михайловича",
        "desc": "Алексею 42 года он любит шахматы. Алексей работает директором по развитию."
      }
    ]
  },
  {
    "year": year,
    "month": 9,
    "day": 6,
    "class": "",
    "hint": [
      {
        "title": "День рождения Орлова Дмитрия Николаевича",
        "desc": "Диме 30 лет, он любит велоспорт. Дима работает в отделе продаж. Ведущим аккаунт-менеджером."
      }
    ]
  },
  {
    "year": year,
    "month": 10,
    "day": 25,
    "class": "",
    "hint": [
      {
        "title": "День рождения Козлова Дмитрия Олеговича",
        "desc": "Диме 36 лет он любит русский рок. Дима работает в отделе SEO-продвижения, старшим копирайтером"
      }
    ]
  },
  {
    "year": year,
    "month": 11,
    "day": 22,
    "class": "",
    "hint": [
      {
        "title": "День рождения Кондратьева Романа Петровича",
        "desc": "Роману 27 лет он любит играть в шахматы. Роман работает в отделе веб-разработки, ведущим веб-программистом. "
      }
    ]
  }
];

export default birthdaysArr;